<template>
    <div class="agree">
        <div class="potic">日日顺乐家用户注册协议</div>
        <div class="item">
            <div class="title">一、重要声明</div>
            <div class="text">1、本协议是确定日日顺乐家与您之间权利义务关系的重要法律文件。一旦您完成日日顺乐家的注册程序，将视为您已经全面阅读、完全理解、全部接受并完全同意遵守本协议的所有内容。</div>
            <div class="text">2、日日顺乐家将不定期地修改本协议，并在重要页面上公告修改内容。如果不同意日日顺乐家对协议的修改，您可以停止使用日日顺乐家的服务。如果继续使用日日顺乐家的服务，则视为您接受日日顺乐家对协议的修改。</div>
        </div>
        <div class="item">
            <div class="title">二、用户信息 </div>
            <div class="text">1、基于日日顺乐家所提供服务的重要性，请您按日日顺乐家的要求提供真实、详尽、准确的个人信息；当个人信息发生变化时，请您及时在日日顺乐家进行更新。如果您提供了错误的个人信息或者未能对个人信息进行及时更新，由此导致的一切后果日日顺乐家将不承担任何责任。 </div>
            <div class="text">2、对于您提供的个人信息，日日顺乐家将严格保密，不接受任何个人和单位的查询请求，除非您本人授权日日顺乐家披露，或者公安机关和司法部门根据国家相关法律法规的规定要求提供。</div>
            <div class="text">3、用户同意，日日顺乐家拥有通过邮件、短信、电话、系统通知等形式，向在日日顺乐家注册、购物用户、收货人发送订单信息、促销活动等告知信息的权利。</div>
        </div>
        <div class="item">
            <div class="title">三、用户账号</div>
            <div class="text">1、注册成功之后，您将获得日日顺乐家提供的登陆账号（含用户名、密码各一个）。请您注意维护该账号的安全，对于以该账号所进行的所有活动，日日顺乐家将不承担任何责任。</div>
            <div class="text">2、若账号有任何非法使用或存在安全漏洞的情况，请您在发现之后立即通知日日顺乐家。</div>
        </div>
        <div class="item">
            <div class="title">四、用户行为规范</div>
            <div class="text">1、您在日日顺乐家所进行的所有活动，请严格遵守我国法律法规及日日顺乐家的相关规定。</div>
            <div class="text">2、您可以在日日顺乐家发表个人言论，但请勿发表包括但不限于以下内容的任何言论：</div>
            <div class="text">（1）煽动抗拒、破坏宪法和法律、行政法规实施的；<br>（2）煽动颠覆国家政权，推翻社会主义制度的；<br>（3）煽动分裂国家、破坏国家统一的；<br>（4）煽动民族仇恨、民族歧视，破坏民族团结的；<br>（5）任何包含对种族、性别、宗教、地域内容等歧视的；<br>（6）捏造或者歪曲事实，散布谣言，扰乱社会秩序的；<br>（7）宣扬封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的；<br>（8）公然侮辱他人或者捏造事实诽谤他人的，或者进行其他恶意攻击的；<br>（9）损害国家机关信誉的；<br>（10）其他违反宪法和法律行政法规的。</div>
            <div class="text">3、请您不要在日日顺乐家发布任何形式的广告。</div>
            <div class="text">4、违反上述条款所导致的一切后果（包括但不限于日日顺乐家遭受的任何损失）需由您承担。</div>
        </div>
        <div class="item">
            <div class="title">五、商品信息</div>
            <div class="text">1、日日顺乐家将努力保障您所购商品的信息与日日顺乐家所公布的内容一致，但日日顺乐家所发布的内容并不构成要约。一旦发现日日顺乐家所显示的商品信息存在明显错误，日日顺乐家有权单方撤回任何承诺。</div>
            <div class="text">2、根据自身的经营需求，日日顺乐家可能对您购买商品的数量进行限制。</div>
            <div class="text">3、提交订单之后，如果由于各种原因（包括但不限于供应商提价、税额上调、网站错误等）造成您所购商品的价格出现变动，您可以在日日顺乐家规定的期限内取消订单。</div>
        </div>
        <div class="item">
            <div class="title">六、货物配送</div>
            <div class="text">1、请您在订单中填写真实姓名、详细地址及联系方式等日日顺乐家要求填写的内容。如因不可抗力或者您填写信息错误导致订单商品延迟送达或无法送达，日日顺乐家不承担任何责任。</div>
            <div class="text">2、日日顺乐家将货物送达时，如无人签收，由此导致重复配送所产生的费用及后果需由您承担。</div>
            <div class="text">3、日日顺乐家列出的送货时间为参考时间，该时间是在库存状况、处理过程、送货地点等信息的基础上估算得出，实际送达时间可能会有出入。</div>
            <div class="text">4、您选择的配送方式不同，送货费用也会有所差异。</div>
            <div class="text">5、日日顺乐家所售商品的售后维保事宜，由该商品的生产厂家负责，但日日顺乐家有其他明示的除外。</div>
        </div>
        <div class="item">
            <div class="title">七、版权声明</div>
            <div class="text">1、您在日日顺乐家发表的观点、文章等作品需文责自负，与日日顺乐家无关。因此，请您不要在日日顺乐家发表侵犯他人合法权益（包括但不限于知识产权）的内容。</div>
            <div class="text">2、日日顺乐家的服务内容（包括但不限于文字、软件、声音、视频、图片、图表、广告等其它信息）受我国法律的保护。请您不要擅自以复制、转载、出版等任何形式使用这些内容，也不要创造与这些内容有关的派生产品，除非获得日日顺乐家书面授权。</div>
            <div class="text">3、获得日日顺乐家书面授权后，您在转载、引用发表于日日顺乐家的作品时请遵守以下规范：</div>
            <div class="text">（1）用于非商业、非盈利、非广告性目的时，需注明作者及作品的出处为日日顺乐家；<br>（2）用于商业、盈利、广告性目的时，需征得作者的同意，并注明作者姓名、授权范围及作品出处为日日顺乐家；<br>（3）任何作品的修改或删除均应征求作者同意并保持作者原意，并注明授权范围。</div>
            <div class="text">4、对于您在日日顺乐家发表的文章或图片等作品，日日顺乐家有权自行使用或者与其他人合作使用于其他用途，包括但不限于网站、电子杂志、杂志、刊物等，使用时日日顺乐家将为作者署名，以作品在日日顺乐家发表时注明的署名为准，作品有附带版权声明的除外。</div>
        </div>
        <div class="item">
            <div class="title">八、责任限制</div>
            <div class="text">如因不可抗力或其它日日顺乐家无法控制的原因，导致网上交易无法完成、丢失有关信息、订单商品无法及时送达等后果，日日顺乐家不承担任何责任。但是日日顺乐家会尽可能合理地协助处理善后事宜，并努力使您免受经济损失。</div>
            <div class="text">对于因在日日顺乐家进行交易而引起的或与之有关的任何损害，日日顺乐家的全部责任，不论是合同、保证、侵权（包括过失）项下的还是其它的责任，均不超过您所购买的与该索赔有关的商品价值额。</div>
        </div>
        <div class="item">
            <div class="title">九、争议解决</div>
            <div class="text">如因日日顺乐家与您之间签订的合同、协议，或履行签订的合同、协议，或发生的其他业务出现的争议，或发生的其他财产权益纠纷，双方应协商解决；协商不成时，双方同意使用中国大陆地区法律并提交青岛市崂山区人民法院诉讼解决。</div>
        </div>
    </div>
</template>
<style scoped lang='less'>
.agree{
    // padding-top:1vh;
    padding:1vh 3.5vw;
    .potic{
        text-align:center;
        font-size:1.2rem;
        font-weight:600;
        
    }
    .item{
        line-height:1.6rem;
    }
}
</style>